import 'package:test3/models/akusherstvo.dart';

const akusherstvoData = AkushersvtoAssets(strukturaMimetriy: [
  'однородная ',
  'неоднородная',
], okoloplondieVodi: [
  'прозрачные',
  'мутные',
], pochkiSostoyanie: [
  'камни',
  'соли',
], xorion: [
  'по передней стенке',
  'по задней стенке',
  'постовуляторный',
  'секреторный',
], vPolosti: [
  '- ',
  '1',
  '2',
  '3',
], polojenitaMatkiList: [
  'антефлексио',
  'ретрофлексио',
  'нонфлексио',
], pochkiCHLS: [
  'не расширен',
  'деформирован',
  'расширен',
], slizistayaList: [
  'тонкая гиперэхогенная полоска',
  'утолщена',
  ' C наличием полоски жидкости в полости',
  'C наличием гиперэхогенного образования'
], vivodi: [
  'Эхопатологии не выявлено',
  'Хронический эндометрит',
  'Полип эндометрия',
  'Аденомиоз тела матки',
  'Узловая миома матки( 1,2,3,4,5,6 типы по Фиго)',
  'Эндоцервицит',
  'Полип цервикального канала',
  'Кисты наботиевых желез',
  'Гидросальпинкс',
  'Киста …. яичника( фолликулярная, геморрагическая, сложная, дермоидная',
  'Сальпингоофорит',
  'Оофорит',
  'Аднексит',
  'Выпот в малом тазу',
  'Пельвиоперитонит',
  'Внематочная беременность',
], yaichnikiList: [
  'мелкофолликулярный',
  'шаровидная',
  'уплотнен',
  'анэхогенное образование округлой формы',
], gemotoma: [
  'нет',
  'по пер-стенке',
  'по задней-стенке',
  'по нижней-стенке',
]);
