import 'package:test3/models/ginekologiya_data.dart';

const ginekologiyaData = GinekologiyaAssets(endrometriyList: [
  'пролиферативный',
  'периовуляторный',
  'постовуляторный',
  'секреторный',
], formaListt: [
  'грушевидная',
  'шаровидная',
  'неправильная',
], konturi: [
  'ровные',
  'неровные',
], miometriyList: [
  'однородный',
  'неоднородный',
  'узлы',
], polojenitaMatkiList: [
  'антефлексио',
  'ретрофлексио',
  'нонфлексио',
], polostList: [
  'чистая',
  'наличии жидкости',
  'гиперэхогенное оброзование диаметром __мм',
], slizistayaList: [
  'тонкая гиперэхогенная полоска',
  'гиперэхогенная мм',
  ' C наличием полоски жидкости в полости',
  'C наличием гиперэхогенного образования',
], vivodi: [
  'Эхопатологии не выявлено',
  'Хронический эндометрит',
  'Полип эндометрия',
  'Аденомиоз тела матки',
  'Узловая миома матки( 1,2,3,4,5,6 типы по Фиго)',
  'Эндоцервицит',
  'Полип цервикального канала',
  'Кисты наботиевых желез',
  'Гидросальпинкс',
  'Киста …. яичника( фолликулярная, геморрагическая, сложная, дермоидная',
  'Сальпингоофорит',
  'Оофорит',
  'Аднексит',
  'Выпот в малом тазу',
  'Пельвиоперитонит',
  'Внематочная беременность',
], yaichnikiList: [
  'мелкофолликулярный',
  'шаровидная',
  'уплотнен',
  'анэхогенное образование округлой формы',
], zadniyDuglasList: [
  'чистый',
  'свободная жидкость в обьеме—- мл'
]);
