import 'package:test3/models/trimestr.dart';

const akusherstvoData = TrimestrAssets(structuraMiometriy: [
  'однородная ',
  'неоднородная',
], okoloplondieVodi: [
  'прозрачные',
  'мутное',
], pochkiSostoyanie: [
  'камней',
  'солей',
], predlejanie: [
  'головное',
  'ягодичное',
  'ножное',
], vPolosti: [
  '- ',
  '1 плод',
  '2 плод',
  '3 плод',
  '4 плод',
  '5 плод',
], polojenie: [
  'продольное',
  'поперечное',
  'косое',
], pochkiCHLS: [
  'не расширен',
  'деформирован',
  'расширен',
], slizistayaList: [
  'тонкая гиперэхогенная полоска',
  'утолщена',
  ' C наличием полоски жидкости в полости',
  'C наличием гиперэхогенного образования'
], vivodi: [
  'Эхопатологии не выявлено',
  'Хронический эндометрит',
  'Полип эндометрия',
  'Аденомиоз тела матки',
  'Узловая миома матки( 1,2,3,4,5,6 типы по Фиго)',
  'Эндоцервицит',
  'Полип цервикального канала',
  'Кисты наботиевых желез',
  'Гидросальпинкс',
  'Киста …. яичника( фолликулярная, геморрагическая, сложная, дермоидная',
  'Сальпингоофорит',
  'Оофорит',
  'Аднексит',
  'Выпот в малом тазу',
  'Пельвиоперитонит',
  'Внематочная беременность',
], yaichnikiList: [
  'мелкофолликулярный',
  'шаровидная',
  'уплотнен',
  'анэхогенное образование округлой формы',
], gemotoma: [
  'нет',
  'по пер-стенке',
  'по задней-стенке',
  'по нижней-стенке',
]);
